//
//  MocData.swift
//  Vicktory
//
//  Created by Greenpilligrim on 17/06/23.
//

import Foundation

struct Quiz: Identifiable {
    var id: UUID = .init()
    var question: String
    var answer: [String]
    var trueAnswer: String
}

var moc: [Quiz] = [
    Quiz(question: "В какое море впадает река Волга?", answer: ["Каспийское море","Азовское море","Черное море","Белое море"], trueAnswer: "Каспийское море"),
    Quiz(question: "Какое самое большое озеро в мире?", answer: ["Каспийское море","Байкал","Северное море","Амазонка"], trueAnswer: "Каспийское море"),
    Quiz(question: "Кто изображен на американской стодолларовой купюре?", answer: ["Джордж Вашингтон","Авраам Линкольн","Бенджамин Франклин","Александр Гамильтон"], trueAnswer: "Бенджамин Франклин"),
    Quiz(question: "Какая самая высокая гора в мире?", answer: ["Эверест","Монблан","Килиманджаро","МакКинли"], trueAnswer: "Эверест"),
    Quiz(question: "Кто написал произведение 'Война и мир'?", answer: ["Александр Солженицын","Федор Достоевский","Антон Чехов","Лев Толстой"], trueAnswer: "Лев Толстой"),
    Quiz(question: "Как называется самая большая планета Солнечной системы?", answer: ["Марс","Венера","Юпитер","Сатурн"], trueAnswer: "Юпитер"),
    Quiz(question: "Кто изображен на итальянской 2-евро монете?", answer: ["Микеланджело","Данте Алигьери","Джузеппе Верди","Леонардо да Винчи"], trueAnswer: "Данте Алигьери"),
    Quiz(question: "Сколько лет длилась Столетняя война?", answer: ["100 лет","116 лет","85 лет","132 года"], trueAnswer: "116 лет"),
    Quiz(question: "Какой год считается годом основания Рима?", answer: ["753 г. до н.э.","500 г. до н.э.","27 г. до н.э.","753 г. н.э."], trueAnswer: "753 г. до н.э.")
    
    
    
]


